---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
RoutingPreferenceRule Properties
RoutingPreferenceRule Class See Also Send Feedback
---

The RoutingPreferenceRule type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Description | The description of the routing preference rule. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | MEPPartId | The referenced MEPPart (segment or fitting) type in this rule. It may be InvalidElementId if no MEPPart will be allowed when the conditions satisfy the criteria in this rule. |
|  | NumberOfCriteria | Gets the number of routing criteria. |
|  | RoutingPreferenceManager | Gets the routing preference manager that owns this rule. |

# See Also

RoutingPreferenceRule Class

Autodesk.Revit.DB Namespace